import { FC } from "react";

const AboutUs: FC = () => {
  return (
    <div className="text-white">
      <div className="bg-slate-900 rounded-xl p-5">
        <h1 className="text-6xl mb-12">Про Нас</h1>
        <p>
          Ласкаво просимо до <strong>Hotline Chernivtsi</strong> — спільноти
          ентузіастів автомобільного спорту та стрітрейсингу в серці Чернівців.
          Засновані у 2010 році, ми об'єднуємо людей, які поділяють пристрасть
          до швидкості, адреналіну та технічних інновацій в автомобільній
          індустрії.
        </p>
      </div>
      <div className="grid-cols-2 grid gap-5 mt-5">
        <div className="bg-slate-900 rounded-xl p-5">
          <h2 className="text-3xl my-6">Наша Місія</h2>
          <p>
            Наша місія полягає в тому, щоб створити безпечне та захоплююче
            середовище для всіх любителів автомобілів. Ми організовуємо
            регулярні заходи, включаючи нічні перегони, дрифт-змагання та
            технічні семінари, щоб сприяти розвитку автомобільної культури в
            регіоні.
          </p>
        </div>
        <div className="bg-slate-900 rounded-xl p-5">
          <h2 className="text-3xl my-6">Чому Обирають Нас</h2>
          <ul>
            <li>
              <strong>Професіоналізм:</strong> Ми дотримуємося високих
              стандартів безпеки та організації.
            </li>
            <li>
              <strong>Спільнота:</strong> Наша спільнота складається з більш ніж
              500 активних учасників.
            </li>
            <li>
              <strong>Розвиток:</strong> Ми підтримуємо новачків та допомагаємо
              розвивати їх навички.
            </li>
          </ul>
        </div>

        <div className="bg-slate-900 rounded-xl p-5">
          <h2 className="text-3xl my-6">Наша Історія</h2>
          <p>
            Почавши як невелика група друзів, які збиралися на околицях міста
            для нічних заїздів, <strong>Hotline Chernivtsi</strong> перетворився
            на велику організацію з офіційними заходами та партнерствами. Ми
            співпрацюємо з місцевими бізнесами та владою для просування
            легального та безпечного стрітрейсингу.
          </p>
        </div>
        <div className="bg-slate-900 rounded-xl p-5">
          <h2 className="text-3xl my-6">Приєднуйтесь до Нас</h2>
          <p>
            Якщо ви поділяєте нашу пристрасть до автомобілів та швидкості, ми
            запрошуємо вас приєднатися до нашої спільноти. Незалежно від вашого
            досвіду, у нас знайдеться місце для кожного.
          </p>
        </div>
      </div>
    </div>
  );
};

export default AboutUs;
