import { FC } from "react";
import Button from "../components/ui/button";

const Home: FC = () => {
  const articles = [
    {
      title: "Нічні перегони на Проспекті: встановлено новий рекорд швидкості",
      tags: ["стрітрейсинг", "Чернівці", "рекорд", "нічні перегони"],
      excerpt:
        "Минулої ночі в Чернівцях на Проспекті Незалежності місцевий стрітрейсер встановив новий рекорд швидкості, досягнувши 220 км/год. Подія зібрала чимало глядачів та викликала захоплення у всіх присутніх.",
    },
    {
      title:
        "Вуличні гонки на Калинівському шосе: змагання кращих дрифтерів міста",
      tags: ["дрифт", "гонки", "Чернівці", "Калинівське шосе"],
      excerpt:
        "Кращі дрифт-майстри Чернівців зібралися на Калинівському шосе, щоб продемонструвати свої вміння та поборотися за звання найкращого. Захід привернув увагу не лише місцевих жителів, а й гостей міста.",
    },
    {
      title:
        '"Hotline-Chernivtsi" оголошує реєстрацію на нічні перегони в парку "Жовтневий"',
      tags: [
        "Hotline-Chernivtsi",
        "стрітрейсинг",
        "реєстрація",
        "нічні перегони",
      ],
      excerpt:
        'Відомий стрітрейсерський клуб "Hotline-Chernivtsi" розпочав реєстрацію учасників на майбутні нічні перегони, які відбудуться в парку "Жовтневий". Організатори обіцяють незабутні враження та адреналін.',
    },
    {
      title:
        "Нові обличчя стрітрейсингу: молоді таланти підкорюють дороги Чернівців",
      tags: ["новачки", "стрітрейсинг", "молоді таланти", "Чернівці"],
      excerpt:
        "Молода генерація стрітрейсерів активно заявляє про себе на нічних дорогах Чернівців. Їхні сміливі маневри та швидкість вражають навіть досвідчених гонщиків.",
    },
    {
      title: "Обговорення з владою: стрітрейсери Чернівців шукають компроміс",
      tags: ["стрітрейсинг", "влада", "безпека", "Чернівці", "обговорення"],
      excerpt:
        "Представники стрітрейсерської спільноти зустрілися з міською владою для обговорення можливості проведення легальних перегонів та забезпечення безпеки на дорогах міста.",
    },
    {
      title:
        "Благодійний заїзд: стрітрейсери збирають кошти для дитячої лікарні",
      tags: ["благодійність", "стрітрейсинг", "Чернівці", "дитяча лікарня"],
      excerpt:
        "Чернівецькі стрітрейсери організовують благодійний заїзд, метою якого є збір коштів на обладнання для місцевої дитячої лікарні. Захід обіцяє бути яскравим та насиченим подіями.",
    },
    {
      title:
        "Технічні новинки: які авто обирають чернівецькі стрітрейсери у 2024 році",
      tags: ["авто", "технічні новинки", "стрітрейсинг", "Чернівці"],
      excerpt:
        "У світі стрітрейсингу з'являються нові технічні рішення та моделі авто. Розповідаємо про найпопулярніші автомобілі, які обирають чернівецькі гонщики цього року.",
    },
    {
      title: "Жіночий стрітрейсинг: дівчата підкорюють дороги Чернівців",
      tags: [
        "жіночий стрітрейсинг",
        "гонщиці",
        "Чернівці",
        "дівчата за кермом",
      ],
      excerpt:
        "Все більше дівчат долучається до стрітрейсерського руху в Чернівцях. Вони демонструють високий рівень майстерності та доводять, що швидкість не має гендерних обмежень.",
    },
    {
      title:
        "Небезпека на дорогах: як стрітрейсери Чернівців дбають про безпеку під час заїздів",
      tags: ["безпека", "стрітрейсинг", "правила", "Чернівці"],
      excerpt:
        "Безпека учасників та глядачів – пріоритет для чернівецьких стрітрейсерів. Дізнайтеся, які заходи вживаються для мінімізації ризиків під час нічних перегонів.",
    },
    {
      title:
        "Міжнародний фестиваль стрітрейсингу: Чернівці готуються приймати гостей з усього світу",
      tags: ["міжнародний фестиваль", "стрітрейсинг", "Чернівці", "гості"],
      excerpt:
        "Вперше в історії міста в Чернівцях відбудеться міжнародний фестиваль стрітрейсингу. Очікується участь гонщиків з різних країн та тисячі відвідувачів.",
    },
  ];

  return (
    <div>
      <h1 className="text-6xl text-white mb-12">Блог</h1>

      <div className="grid gap-5 grid-cols-2">
        {articles.map((blog) => (
          <div
            key={blog.title}
            className="p-5 flex flex-col bg-slate-900 rounded-xl mb-5"
          >
            <div>
              <h2 className="text-2xl text-white">{blog.title}</h2>
              <div>
                {blog.tags.map((tag) => (
                  <span key={tag} className="text-red-500  text-xs mr-2">
                    #{tag}
                  </span>
                ))}
              </div>
            </div>
            <p className="text-white">{blog.excerpt}</p>
            <Button className="ml-auto">Читати далі</Button>
          </div>
        ))}
      </div>
    </div>
  );
};

export default Home;
